In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# EDA for Imdb files

In [2]:
akas_df = pd.read_csv('./data/imdb.title.akas.csv')
basics_df = pd.read_csv('./data/imdb.title.basics.csv')
name_basics = pd.read_csv('./data/imdb.name.basics.csv')

In [3]:
akas_df.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [4]:
basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [5]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [6]:
akas_df['title_id'].unique()

array(['tt0369610', 'tt0381957', 'tt0401729', ..., 'tt9755806',
       'tt9827784', 'tt9880178'], dtype=object)

In [7]:
akas_df['language'].unique()

array(['bg', nan, 'he', 'fr', 'tr', 'ka', 'ta', 'te', 'en', 'sv', 'hr',
       'de', 'hi', 'sl', 'ca', 'fa', 'es', 'ml', 'cmn', 'yue', 'qbp',
       'cs', 'ar', 'ms', 'nl', 'qbn', 'tl', 'mr', 'id', 'ga', 'th', 'bs',
       'bn', 'sr', 'sk', 'et', 'it', 'hu', 'da', 'el', 'pt', 'fi', 'no',
       'ru', 'uk', 'ro', 'lt', 'ur', 'gsw', 'mi', 'az', 'eu', 'la', 'gl',
       'af', 'kn', 'pl', 'yi', 'wo', 'zu', 'xh', 'st', 'tn', 'iu', 'vi',
       'cy', 'ko', 'fro', 'gu', 'mk', 'ps', 'pa', 'zh', 'ja', 'gd', 'ku',
       'qal'], dtype=object)

In [8]:
akas_df['attributes'].unique()

array([nan, 'short title', '3-D version', 'fake working title',
       'informal alternative title', 'dubbed version',
       'transliterated ISO-LATIN-1 title', 'original script title',
       'IMAX version', 'alternative spelling', 'DVD box title',
       'new title', 'literal title', 'literal English title',
       'alternative transliteration', 'promotional title', 'poster title',
       'cable TV title', 'informal title', 'long title',
       'informal literal English title', 'promotional abbreviation',
       'complete title', 'informal short title', 'rerun title',
       'original subtitled version', 'longer version',
       'informal literal title', 'theatrical title', 'trailer title',
       'informal English title', 'closing credits title',
       'Cannes festival title', 'Berlin film festival title',
       'bootleg title', 'reissue title', 'series title', 'review title',
       'literal translation of working title', 'premiere title',
       'segment title', 'long new title', 'pre-release title',
       'bowdlerized title', 'recut version', 'subtitle',
       'second copyright title', 'censored version', "director's cut",
       'Venice film festival title', 'DVD menu title', 'première title',
       'cut version', 'short version', 'TV listings title',
       'anthology series', 'copyright title', 'correct transliteration',
       'first episode title', 'uncensored intended title', 'teaser title',
       'first season title', 'second season title',
       'video catalogue title', 'orthographically correct title',
       'video box title', 'soft porn version',
       'Los Angeles premiere title', 'unauthorized video title',
       'first part title', 'second part title', 'english transliteration',
       '8mm release title', 'reissue title\x02short version',
       'expansion title', 'third part title', 'YIVO translation',
       'X-rated version'], dtype=object)

In [9]:
akas_df['attributes'].value_counts()

new title                      1700
alternative spelling           1394
literal English title          1054
complete title                 1034
original subtitled version      879
                               ...
8mm release title                 1
TV listings title                 1
reissue titleshort version       1
first season title                1
X-rated version                   1
Name: attributes, Length: 77, dtype: int64

In [10]:
akas_df['is_original_title'].unique()

array([ 0.,  1., nan])

In [11]:
akas_df['is_original_title'].value_counts()

0.0    286978
1.0     44700
Name: is_original_title, dtype: int64

In [12]:
original_subset = akas_df[akas_df['is_original_title'] == 1.0]

In [13]:
original_subset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 44700 entries, 38 to 331700
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title_id           44700 non-null  object
 1   ordering           44700 non-null  int64
 2   title              44700 non-null  object
 3   region             6 non-null      object
 4   language           4 non-null      object
 5   types              44700 non-null  object
 6   attributes         0 non-null      object
 7   is_original_title  44700 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 3.1+ MB

In [14]:
akas_df[akas_df['title_id'] == 'tt2488496']

,title_id,ordering,title,region,language,types,attributes,is_original_title
109985,tt2488496,10,Звёздные войны: Пробуждение Силы,RU,NaN,NaN,NaN,0.0
109986,tt2488496,11,Ο Πόλεμος των Άστρων: Επεισόδιο 7 - Η Δύναμη Ξ...,GR,NaN,NaN,NaN,0.0
109987,tt2488496,12,Star Wars: Az ébredő Erő,HU,NaN,NaN,NaN,0.0
109988,tt2488496,13,Star Wars: Η δύναμη ξυπνάει,GR,NaN,NaN,NaN,0.0
109989,tt2488496,14,Hvězdné války VII: Síla se probouzí,CZ,NaN,NaN,NaN,0.0
...,...,...,...,...,...,...,...,...
110041,tt2488496,61,Žvaigždžiu karai: galia nubunda,LT,NaN,NaN,NaN,0.0
110042,tt2488496,6,Star Wars: El Despertar de la Fuerza,BO,es,NaN,poster title,0.0
110043,tt2488496,7,Sutâ wôzu: Fôsu no kakusei,NaN,NaN,NaN,NaN,0.0
110044,tt2488496,8,Star Wars: The Force Awakens,SE,NaN,imdbDisplay,NaN,0.0
110045,tt2488496,9,Зорянi вiйни: Епiзод 7 - Пробудження сили,UA,NaN,NaN,NaN,0.0

## .akas.csv usefulness

Appears to be listings of alternative names for movies, with some information about different attributes that each might have. Other than the translated names and title ids, many other fields are sparse, including region, language, and attributes. Likely this dataset is not particularly useful for our purposes. Potentially could be used to infer the scope of distribution given other information later on, but that's about it.

## title.basics.csv

In [15]:
basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [16]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [17]:
basics_df.describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [18]:
basics_df['start_year'].value_counts()

2017    17504
2016    17272
2018    16849
2015    16243
2014    15589
2013    14709
2012    13787
2011    12900
2010    11849
2019     8379
2020      937
2021       83
2022       32
2023        5
2024        2
2027        1
2026        1
2025        1
2115        1
Name: start_year, dtype: int64

In [19]:
basics_df[basics_df['start_year'] >= 2024]

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
2948,tt10300396,Untitled Star Wars Film,Untitled Star Wars Film,2024,NaN,NaN
2949,tt10300398,Untitled Star Wars Film,Untitled Star Wars Film,2026,NaN,Fantasy
52213,tt3095356,Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
89506,tt5174640,100 Years,100 Years,2115,NaN,Drama
96592,tt5637536,Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"
105187,tt6149054,Fantastic Beasts and Where to Find Them 5,Fantastic Beasts and Where to Find Them 5,2024,NaN,"Adventure,Family,Fantasy"

The data set includes films to be released in the future, most of which appear to be pretty obiously large studio current approvals. This likely will be relevant to consider, the values might not need to be dropped, but depending on how we're drawing conclusions it could be important.

In [20]:
basics_df['genres'].value_counts()

Documentary                   32185
Drama                         21486
Comedy                         9177
Horror                         4372
Comedy,Drama                   3519
                              ...
Family,Sci-Fi,Thriller            1
Documentary,News,Sci-Fi           1
Action,Musical,Thriller           1
Horror,Talk-Show                  1
Adventure,Biography,Family        1
Name: genres, Length: 1085, dtype: int64

In [21]:
len(basics_df['genres'].unique())

1086

The genres column likely will need some cleaning before being usable. We still might not necessarily want to be grouping "Comedy" with "Comedy, Drama", but we might, and having the ability to would be nice regardless. Need to consider how to accomplish that as I don't think pandas really likes lists as entries, but I could be wrong.

In [22]:
basics_df['runtime_minutes'].value_counts()

90.0     7131
80.0     3526
85.0     2915
100.0    2662
95.0     2549
         ...
382.0       1
724.0       1
808.0       1
287.0       1
540.0       1
Name: runtime_minutes, Length: 367, dtype: int64

In [23]:
basics_df.sort_values('runtime_minutes', ascending=False)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
132389,tt8273150,Logistics,Logistics,2012,51420.0,Documentary
44840,tt2659636,Modern Times Forever,Modern Times Forever,2011,14400.0,Documentary
123467,tt7492094,Nari,Nari,2017,6017.0,Documentary
87264,tt5068890,Hunger!,Hunger!,2015,6000.0,"Documentary,Drama"
88717,tt5136218,London EC1,London EC1,2015,5460.0,"Comedy,Drama,Mystery"
...,...,...,...,...,...,...
146131,tt9915790,Bobbyr Bondhura,Bobbyr Bondhura,2019,NaN,Family
146138,tt9916428,The Secret of China,The Secret of China,2019,NaN,"Adventure,History,War"
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

The longest values in the runtime_minutes column seem as if they might be errors somehow, however they are actual film runtimes. It may be important to consider how relevant these outliers are. The runtime_minutes column also has a decent amount of empty values that will need to be accounted for.

## title.basics.csv usefulness

This dataset could give us good information on the genre distribution of films as a whole, though that's not likely to be a good indicator of return on investment. Likewise we can view range of runtimes, but this needs to be coupled to other information that can provide a basis for a recommendation.

## name.basics.csv

In [24]:

name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [25]:
name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [26]:
name_basics['known_for_titles'].value_counts()

tt4773466                                  45
tt3014460                                  23
tt3428990                                  23
tt4803104                                  19
tt2120166                                  17
                                           ..
tt5201164                                   1
tt0395169,tt7136896,tt0120738,tt1821362     1
tt2785866,tt4649820,tt0129748,tt6681990     1
tt9310136,tt3215824,tt6111130,tt4920128     1
tt1748531,tt0300746,tt0322629,tt0407377     1
Name: known_for_titles, Length: 482207, dtype: int64

Similarly to the genres category from the previous data set, both the 'known_for_titles' and 'primary_profession' columns are made up of values that are sometimes combined smaller values and that will need to be separated to be usable. As it is, the film ids in 'known_for_titles' will likely make it possible to join this table with others in order to draw conclusions.

# Overall Assessment

Out of these 3 files, the title.basics and name.basics files will likely be most useful. However both will likely need to be cleaned and joined to another dataset that has more relevant information for a recommendation. Both of these files have columns with film ids in them which will hopefully make this somewhat painless to do.